duxinglang-1/nRF9160_test/AURI_TEST/src/screen/screen.c
void NotifyScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_NOTIFY].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_NOTIFY].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_NOTIFY].status = SCREEN_STATUS_CREATED;
				
		NotifyShow();
		break;
		
	case SCREEN_ACTION_UPDATE:
		break;
	}
	
	scr_msg[SCREEN_ID_NOTIFY].act = SCREEN_ACTION_NO;

}

void SOSShowStatus(void)
{
	u32_t img_addr;
	u8_t *img;
	
	LCD_Clear(BLACK);

	switch(sos_state)
	{
	case SOS_STATUS_IDLE:
		break;
		
	case SOS_STATUS_SENDING:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_SOS_ADDR;
	#else
		//img = IMG_SOS;
	#endif
		break;
	
	case SOS_STATUS_SENT:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_SOS_SEND_ADDR;
	#else
		//img = IMG_SOS_SEND;
	#endif
		break;
	
	case SOS_STATUS_RECEIVED:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_SOS_RECE_ADDR;
	#else
		//img = IMG_SOS_RECE;
	#endif
		break;
	
	case SOS_STATUS_CANCEL:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_SOS_ADDR;
	#else
		//img = IMG_SOS;
	#endif
		break;
	}

#ifdef IMG_FONT_FROM_FLASH
	LCD_ShowImg_From_Flash(SOS_X, SOS_Y, img_addr);
#else
	LCD_ShowImg(SOS_X, SOS_Y, img);
#endif
}

void SOSScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_SOS].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_SOS].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_SOS].status = SCREEN_STATUS_CREATED;

		SOSShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_SOS].para&SCREEN_EVENT_UPDATE_SOS)
		{
			scr_msg[SCREEN_ID_SOS].para &= (~SCREEN_EVENT_UPDATE_SOS);
			SOSShowStatus();
		}

		if(scr_msg[SCREEN_ID_SOS].para == SCREEN_EVENT_UPDATE_NO)
			scr_msg[SCREEN_ID_SOS].act = SCREEN_ACTION_NO;
		break;
	}
}

void SleepUpdateStatus(void)
{
	u16_t total_sleep,deep_sleep,light_sleep;
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
	
	GetSleepTimeData(&deep_sleep, &light_sleep);
	total_sleep = deep_sleep+light_sleep;
	
	LCD_ShowImg(SLEEP_NUM_1_X, SLEEP_NUM_1_Y, img_num[(total_sleep/60)/10]);
	LCD_ShowImg(SLEEP_NUM_2_X, SLEEP_NUM_2_Y, img_num[(total_sleep/60)%10]);
	LCD_ShowImg(SLEEP_NUM_3_X, SLEEP_NUM_3_Y, img_num[(total_sleep%60)/10]);
	LCD_ShowImg(SLEEP_NUM_4_X, SLEEP_NUM_4_Y, img_num[(total_sleep%60)%10]);
}

void SleepShowStatus(void)
{
	u16_t total_sleep,deep_sleep,light_sleep;
	unsigned char *img_anima[4] = {IMG_SLEEP_ICON_1,IMG_SLEEP_ICON_2,IMG_SLEEP_ICON_3,IMG_SLEEP_ICON_4};
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
	unsigned char *img_uint_hr[2] = {IMG_SLEEP_HR_CN, IMG_SLEEP_HR_EN};
	unsigned char *img_uint_min[2] = {IMG_SLEEP_MIN_CN, IMG_SLEEP_MIN_EN};
	
	GetSleepTimeData(&deep_sleep, &light_sleep);
	total_sleep = deep_sleep+light_sleep;
	
	LCD_Clear(BLACK);

	AnimaShow(SLEEP_ICON_X, SLEEP_ICON_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);

	LCD_ShowImg(SLEEP_NUM_1_X, SLEEP_NUM_1_Y, img_num[(total_sleep/60)/10]);
	LCD_ShowImg(SLEEP_NUM_2_X, SLEEP_NUM_2_Y, img_num[(total_sleep/60)%10]);
	LCD_ShowImg(SLEEP_NUM_3_X, SLEEP_NUM_3_Y, img_num[(total_sleep%60)/10]);
	LCD_ShowImg(SLEEP_NUM_4_X, SLEEP_NUM_4_Y, img_num[(total_sleep%60)%10]);

	if(global_settings.language == LANGUAGE_CHN)
	{
		LCD_ShowImg(SLEEP_HOUR_X, SLEEP_HOUR_Y, img_uint_hr[0]);
		LCD_ShowImg(SLEEP_MIN_X, SLEEP_MIN_Y, img_uint_min[0]);
	}
	else
	{
		LCD_ShowImg(SLEEP_HOUR_X, SLEEP_HOUR_Y, img_uint_hr[1]);
		LCD_ShowImg(SLEEP_MIN_X, SLEEP_MIN_Y, img_uint_min[1]);
	}
}

void SleepScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_SLEEP].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_SLEEP].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_SLEEP].status = SCREEN_STATUS_CREATED;

		SleepShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		SleepUpdateStatus();
		break;
	}
	
	scr_msg[SCREEN_ID_SLEEP].act = SCREEN_ACTION_NO;
}

void StepsUpdateStatus(void)
{
	u16_t steps;
	u16_t offset_x;
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
	
	GetSportData(&steps,NULL,NULL);

	if(global_settings.language == LANGUAGE_CHN)
		offset_x = STEPS_CN_OFFSET;
	else
		offset_x = 0;

	LCD_ShowImg(STEPS_NUM_1_X+offset_x, STEPS_NUM_1_Y, img_num[steps/10000]);
	LCD_ShowImg(STEPS_NUM_2_X+offset_x, STEPS_NUM_2_Y, img_num[(steps%10000)/1000]);
	LCD_ShowImg(STEPS_NUM_3_X+offset_x, STEPS_NUM_3_Y, img_num[(steps%1000)/100]);
	LCD_ShowImg(STEPS_NUM_4_X+offset_x, STEPS_NUM_4_Y, img_num[(steps%100)/10]);
	LCD_ShowImg(STEPS_NUM_5_X+offset_x, STEPS_NUM_5_Y, img_num[steps%10]);	
}

void StepsShowStatus(void)
{
	u16_t steps;
	u16_t offset_x;
	unsigned char *img_anima[2] = {IMG_STEP_ICON_1, IMG_STEP_ICON_2};
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
	unsigned char *img_uint[2] = {IMG_STEP_CN, IMG_STEP_EN};
	
	GetSportData(&steps,NULL,NULL);

	LCD_Clear(BLACK);

	AnimaShow(STEPS_ICON_X, STEPS_ICON_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);

	if(global_settings.language == LANGUAGE_CHN)
		offset_x = STEPS_CN_OFFSET;
	else
		offset_x = 0;

	LCD_ShowImg(STEPS_NUM_1_X+offset_x, STEPS_NUM_1_Y, img_num[steps/10000]);
	LCD_ShowImg(STEPS_NUM_2_X+offset_x, STEPS_NUM_2_Y, img_num[(steps%10000)/1000]);
	LCD_ShowImg(STEPS_NUM_3_X+offset_x, STEPS_NUM_3_Y, img_num[(steps%1000)/100]);
	LCD_ShowImg(STEPS_NUM_4_X+offset_x, STEPS_NUM_4_Y, img_num[(steps%100)/10]);
	LCD_ShowImg(STEPS_NUM_5_X+offset_x, STEPS_NUM_5_Y, img_num[steps%10]);

	if(global_settings.language == LANGUAGE_CHN)
		LCD_ShowImg(STEPS_UNIT_X+offset_x, STEPS_UNIT_Y, img_uint[0]);
	else
		LCD_ShowImg(STEPS_UNIT_X, STEPS_UNIT_Y, img_uint[1]);	
}

void StepsScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_STEPS].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_STEPS].status = SCREEN_STATUS_CREATED;

		StepsShowStatus();
		break;
		
