duxinglang-1/nRF9160_test/AURI_TEST/src/screen/screen.c
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_STEPS].para&SCREEN_EVENT_UPDATE_SPORT)
			scr_msg[SCREEN_ID_STEPS].para &= (~SCREEN_EVENT_UPDATE_SPORT);

		StepsUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_STEPS].act = SCREEN_ACTION_NO;
}

void DistanceUpdateStatus(void)
{
	u16_t distance;
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};

	GetSportData(NULL,NULL,&distance);

	LCD_ShowImg(DIS_NUM_1_X, DIS_NUM_1_Y, img_num[distance/10000]);
	LCD_ShowImg(DIS_NUM_2_X, DIS_NUM_2_Y, img_num[(distance%10000)/1000]);
	LCD_ShowImg(DIS_DOT_X, DIS_DOT_Y, IMG_DOT);
	LCD_ShowImg(DIS_NUM_3_X, DIS_NUM_3_Y, img_num[(distance%100)/10]);
	LCD_ShowImg(DIS_NUM_4_X, DIS_NUM_4_Y, img_num[distance%10]);
}

void DistanceShowStatus(void)
{
	u16_t distance;
	unsigned char *img_anima[2] = {IMG_DISTANCE_ICON_1, IMG_DISTANCE_ICON_2};
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
	unsigned char *img_km[2] = {IMG_KM_CN, IMG_KM_EN};
	
	GetSportData(NULL,NULL,&distance);

	LCD_Clear(BLACK);
	
	AnimaShow(DIS_ICON_X, DIS_ICON_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);

	LCD_ShowImg(DIS_NUM_1_X, DIS_NUM_1_Y, img_num[distance/10000]);
	LCD_ShowImg(DIS_NUM_2_X, DIS_NUM_2_Y, img_num[(distance%10000)/1000]);
	LCD_ShowImg(DIS_DOT_X, DIS_DOT_Y, IMG_DOT);
	LCD_ShowImg(DIS_NUM_3_X, DIS_NUM_3_Y, img_num[(distance%100)/10]);
	LCD_ShowImg(DIS_NUM_4_X, DIS_NUM_4_Y, img_num[distance%10]);
	
	if(global_settings.language == LANGUAGE_CHN)
		LCD_ShowImg(DIS_KM_X, DIS_KM_Y, img_km[0]);
	else
		LCD_ShowImg(DIS_KM_X, DIS_KM_Y, img_km[1]);
}

void DistanceScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_DISTANCE].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_DISTANCE].status = SCREEN_STATUS_CREATED;

		DistanceShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_DISTANCE].para&SCREEN_EVENT_UPDATE_SPORT)
			scr_msg[SCREEN_ID_DISTANCE].para &= (~SCREEN_EVENT_UPDATE_SPORT);

		DistanceUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_DISTANCE].act = SCREEN_ACTION_NO;
}

void CalorieUpdateStatus(void)
{
	u16_t distance;
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};

	GetSportData(NULL,NULL,&distance);

	LCD_ShowImg(DIS_NUM_1_X, DIS_NUM_1_Y, img_num[distance/10000]);
	LCD_ShowImg(DIS_NUM_2_X, DIS_NUM_2_Y, img_num[(distance%10000)/1000]);
	LCD_ShowImg(DIS_DOT_X, DIS_DOT_Y, IMG_DOT);
	LCD_ShowImg(DIS_NUM_3_X, DIS_NUM_3_Y, img_num[(distance%1000)/100]);
	LCD_ShowImg(DIS_NUM_4_X, DIS_NUM_4_Y, img_num[distance%100]);
}

void CalorieShowStatus(void)
{
	u16_t calorie;
	unsigned char *img_anima[2] = {IMG_CAL_ICON_1, IMG_CAL_ICON_2};
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
	unsigned char *img_cal[2] = {IMG_CAL_CN, IMG_CAL_EN};
	
	GetSportData(NULL,&calorie,NULL);

	LCD_Clear(BLACK);
	
	AnimaShow(CAL_ICON_X, CAL_ICON_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);

	LCD_ShowImg(CAL_NUM_1_X, CAL_NUM_1_Y, img_num[calorie/1000]);
	LCD_ShowImg(CAL_NUM_2_X, CAL_NUM_2_Y, img_num[(calorie%1000)/100]);
	LCD_ShowImg(CAL_NUM_3_X, CAL_NUM_3_Y, img_num[(calorie%100)/10]);
	LCD_ShowImg(CAL_NUM_4_X, CAL_NUM_4_Y, img_num[calorie%10]);
	
	if(global_settings.language == LANGUAGE_CHN)
		LCD_ShowImg(CAL_UNIT_X, CAL_UNIT_Y, img_cal[0]);
	else
		LCD_ShowImg(CAL_UNIT_X, CAL_UNIT_Y, img_cal[1]);
}

void CalorieScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_CALORIE].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_CALORIE].status = SCREEN_STATUS_CREATED;

		CalorieShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_CALORIE].para&SCREEN_EVENT_UPDATE_SPORT)
			scr_msg[SCREEN_ID_CALORIE].para &= (~SCREEN_EVENT_UPDATE_SPORT);

		CalorieUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_CALORIE].act = SCREEN_ACTION_NO;
}


void FallShowStatus(void)
{
	u16_t x,y;
	u32_t img_addr;
	u8_t *img;

	LCD_Clear(BLACK);

	switch(global_settings.language)
	{
	case LANGUAGE_EN:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_FALL_EN_ADDR;
	#else
		//img = IMG_FALL_EN;
	#endif
		x = FALL_EN_TEXT_X;
		y = FALL_CN_TEXT_Y;
		break;
		
	case LANGUAGE_CHN:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_FALL_CN_ADDR;
	#else
		//img = IMG_FALL_CN;
	#endif
		x = FALL_CN_TEXT_X;
		y = FALL_CN_TEXT_Y;	
		break;
	}

#ifdef IMG_FONT_FROM_FLASH
	LCD_ShowImg_From_Flash(FALL_ICON_X, FALL_ICON_Y, IMG_FALL_ICON_ADDR);
	LCD_ShowImg_From_Flash(x, y, img_addr);
#else
	//LCD_ShowImg(FALL_ICON_X, FALL_ICON_Y, IMG_FALL_ICON);
	LCD_ShowImg(x, y, img);
#endif
}

void FallScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_FALL].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_FALL].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_FALL].status = SCREEN_STATUS_CREATED;

		FallShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		break;
	}
	
	scr_msg[SCREEN_ID_FALL].act = SCREEN_ACTION_NO;
}

void WristShowStatus(void)
{
//	unsigned char *img[2] = {IMG_WRIST_OFF_CN, IMG_WRIST_OFF_EN};

//	if(global_settings.language == LANGUAGE_CHN)
//		LCD_ShowImg(CAL_UNIT_X, CAL_UNIT_Y, img[0]);
//	else
//		LCD_ShowImg(CAL_UNIT_X, CAL_UNIT_Y, img[1]);
}

void WristScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_WRIST].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_WRIST].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_WRIST].status = SCREEN_STATUS_CREATED;

		WristShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		break;
	}
	
	scr_msg[SCREEN_ID_WRIST].act = SCREEN_ACTION_NO;
}

#ifdef CONFIG_FOTA_DOWNLOAD
void FOTAShowStatus(void)
{
	u16_t x,y,w,h;
	u8_t str_title[] = "FOTA RUNNING";

	LCD_Clear(BLACK);
	//LCD_DrawRectangle(FOTA_NOTIFY_RECT_X, FOTA_NOTIFY_RECT_Y, FOTA_NOTIFY_RECT_W, FOTA_NOTIFY_RECT_H);
	//LCD_Fill(FOTA_NOTIFY_RECT_X+1, FOTA_NOTIFY_RECT_Y+1, FOTA_NOTIFY_RECT_W-1, FOTA_NOTIFY_RECT_H-1, BLACK);
	
	LCD_SetFontSize(FONT_SIZE_16);
	LCD_MeasureString(str_title, &w, &h);
	x = (w > (FOTA_NOTIFY_RECT_W-2*FOTA_NOTIFY_OFFSET_W))? 0 : ((FOTA_NOTIFY_RECT_W-2*FOTA_NOTIFY_OFFSET_W)-w)/2;
	x += (FOTA_NOTIFY_RECT_X+FOTA_NOTIFY_OFFSET_W);
	y = 20;
	LCD_ShowString(x,y,str_title);

	ShowStringsInRect(FOTA_NOTIFY_STRING_X, 
					  FOTA_NOTIFY_STRING_Y, 
					  FOTA_NOTIFY_STRING_W, 
					  FOTA_NOTIFY_STRING_H, 
					  FONT_SIZE_16, 
					  "Make sure the battery is at least 20% full and don't do anything during the upgrade!");

	LCD_DrawRectangle(FOTA_NOTIFY_YES_X, FOTA_NOTIFY_YES_Y, FOTA_NOTIFY_YES_W, FOTA_NOTIFY_YES_H);
	LCD_MeasureString("SOS(Y)", &w, &h);
	x = FOTA_NOTIFY_YES_X+(FOTA_NOTIFY_YES_W-w)/2;
	y = FOTA_NOTIFY_YES_Y+(FOTA_NOTIFY_YES_H-h)/2;	
	LCD_ShowString(x,y,"SOS(Y)");

	LCD_DrawRectangle(FOTA_NOTIFY_NO_X, FOTA_NOTIFY_NO_Y, FOTA_NOTIFY_NO_W, FOTA_NOTIFY_NO_H);
	LCD_MeasureString("PWR(N)", &w, &h);
	x = FOTA_NOTIFY_NO_X+(FOTA_NOTIFY_NO_W-w)/2;
	y = FOTA_NOTIFY_NO_Y+(FOTA_NOTIFY_NO_H-h)/2;	
	LCD_ShowString(x,y,"PWR(N)");

	Key_Event_register_Handler(fota_start_confirm, fota_exit);
#ifdef CONFIG_TOUCH_SUPPORT
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, FOTA_NOTIFY_YES_X, FOTA_NOTIFY_YES_X+FOTA_NOTIFY_YES_W, FOTA_NOTIFY_YES_Y, FOTA_NOTIFY_YES_Y+FOTA_NOTIFY_YES_H, fota_start_confirm);
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, FOTA_NOTIFY_NO_X, FOTA_NOTIFY_NO_X+FOTA_NOTIFY_NO_W, FOTA_NOTIFY_NO_Y, FOTA_NOTIFY_NO_Y+FOTA_NOTIFY_NO_H, fota_exit);
#endif
	
